// 位置数据
const locations = [
    // 去过的地方
    { name: '北京', coord: [116.4074, 39.9042], type: 'past', description: '小学四年级去过故宫、鸟巢、水立方和北京动物园，北京挺好玩的。' },
    { name: '天津', coord: [117.1994, 39.0851], type: 'past', description: '在这里生活过一段时间' },
    { name: '天津牛镇新苑', coord: [116.8931, 39.624688], type: 'past', description: '在这里生活过一段时间' },
    { name: '济南', coord: [117.1201, 36.6512], type: 'past', description: '在这里生活过一段时间' },
    { name: '德州', coord: [116.3075, 37.4538], type: 'past', description: '在这里生活过一段时间' },
    { name: '郑州', coord: [113.6254, 34.7466], type: 'past', description: '在这里生活过一段时间' },
    { name: '开封', coord: [114.3076, 34.7972], type: 'past', description: '在这里生活过一段时间' },
    { name: '兰考县', coord: [114.8186, 34.8222], type: 'past', description: '在这里生活过一段时间，在这里考的驾驶证。' },
    // { name: '襄阳', coord: [112.1224, 32.0090], type: 'past', description: '在这里读大学生活学习' },
    // { name: '襄阳职业技术学院', coord: [112.083233,32.005619], type: 'past', description: '在这里读大学生活学习' },
    { name: '荆州', coord: [112.2397, 30.3352], type: 'past', description: '在这里生活过一段时间' },
    { name: '公安县', coord: [112.2295, 30.0583], type: 'past', description: '在这里读的高中' },
    { name: '石首市', coord: [112.4257, 29.7209], type: 'past', description: '在这里生活过一段时间' },
    { name: '武汉', coord: [114.3054, 30.5928], type: 'past', description: '在这里生活过一段时间' },
    { name: '岳阳', coord: [113.1289, 29.3571], type: 'travel', description: '在这里生活过一段时间' },
    { name: '长沙', coord: [112.9389, 28.2282], type: 'past', description: '在这里生活过一段时间' },
    { name: '长沙南站', coord: [113.06551, 28.147093], type: 'past', description: '在这里生活过一段时间' },
    { name: '浏阳市', coord: [113.6431, 28.1628], type: 'past', description: '在这里生活，未来久居的地点。' },
    { name: '南京', coord: [118.7969, 32.0603], type: 'past', description: '在这里工作过一段时间' },
    { name: '南京南站', coord: [118.798039, 31.96875], type: 'work', description: '在这里工作过一段时间' },
    { name: '泰州', coord: [119.9231, 32.4558], type: 'past', description: '在这里旅游过' },
    { name: '重庆', coord: [106.5516, 29.5630], type: 'past', description: '在这里旅游过' },
    { name: '云阳县', coord: [108.6973, 30.9306], type: 'work', description: '在这里工作过一段时间' },
    { name: '国家电网（双土供电营业厅）', coord: [108.921805,31.155217], type: 'sgcc', description: '2024年9月在这里开始第一段实习工作，在国家电网负责计量箱设备的维护统计。' },
    { name: '小河口镇', coord: [112.62323, 29.776849], type: 'past', description: '在这过年' },
    { name: '浏阳市君悦阳光里', coord: [113.61335,28.16805], type: 'past', description: '在这居住' },
    { name: '浏阳市官渡古镇', coord: [113.88681,28.347944], type: 'past', description: '官渡古镇' },
    { name: '浏阳市张坊镇', coord: [114.109434,28.324145], type: 'past', description: '张坊镇' },
    { name: '青海省西宁市锦程嘉苑小区', coord: [101.752593,36.638384], type: 'past', description: '在这里居住工作' },
    { name: '国家电网综合大楼', coord: [101.754968,36.636605], type: 'sgcc', description: '青海省西宁市城西区新宁路与西交通巷交叉口西北60米' },
    { name: '西宁市自然资源和规划局', coord: [101.745755,36.636307], type: 'chinagov', description: '在西宁市自然资源和规划局参与地理信息系统数据治理。' },
    { name: 'IFC国际金融中心', coord: [114.274388,30.591705], type: 'current', description: '在此处做系统运维与技术支持。' },
    { name: '国家税务总局湖北省税务局第三税务分局', coord: [114.344578,30.552697], type: 'chinagov', description: '在中国软件这里做驻点核心征管税务系统运维。' },
    // 计划去的地方
    // { name: '青海西宁市', coord: [101.7782, 36.6171], type: 'future', description: '计划前往的目的地，2025工作地点' }
];

// 路线数据
const routes = [
    {
        from: '青海省西宁市锦程嘉苑小区',
        to: '国家电网综合大楼',
        path: [
            [
              101.75257,
              36.638366
            ],
            [
              101.752796,
              36.638293
            ],
            [
              101.752679,
              36.637804
            ],
            [
              101.75281,
              36.637311
            ],
            [
              101.752787,
              36.636832
            ],
            [
              101.75276,
              36.636753
            ],
            [
              101.755091,
              36.635919
            ],
            [
              101.755362,
              36.636368
            ],
            [
              101.75515,
              36.636473
            ]
          ]
    },{
        from: '小河口镇',
        to: '浏阳市君悦阳光里',
        path: [
            [112.62323, 29.776849],
            [113.128959,29.355644],
            [113.212745,28.225234],
            [113.61335,28.16805]
        ]
    },{
        from: '北京',
        to: '天津',
        path: [
            [116.4074, 39.9042],
            [117.1994, 39.0851]
        ]
    },
    {
        from: '天津',
        to: '济南',
        path: [
            [117.1994, 39.0851],
            [117.1201, 36.6512]
        ]
    },
    {
        from: '济南',
        to: '德州',
        path: [
            [117.1201, 36.6512],
            [116.3075, 37.4538]
        ]
    },
    {
        from: '德州',
        to: '郑州',
        path: [
            [116.3075, 37.4538],
            [113.6254, 34.7466]
        ]
    },
    {
        from: '郑州',
        to: '开封',
        path: [
            [113.6254, 34.7466],
            [114.3076, 34.7972]
        ]
    },
    {
        from: '开封',
        to: '兰考县',
        path: [
            [114.3076, 34.7972],
            [114.8186, 34.8222]
        ]
    },
    {
        from: '兰考县',
        to: '襄阳',
        path: [
            [114.8186, 34.8222],
            [112.1224, 32.0090]
        ]
    },
    {
        from: '襄阳',
        to: '荆州',
        path: [
            [112.1224, 32.0090],
            [112.2397, 30.3352]
        ]
    },
    {
        from: '荆州',
        to: '公安县',
        path: [
            [112.2397, 30.3352],
            [112.2295, 30.0583]
        ]
    },
    {
        from: '公安县',
        to: '石首市',
        path: [
            [112.2295, 30.0583],
            [112.4257, 29.7209]
        ]
    },
    {
        from: '武汉',
        to: '岳阳',
        path: [
            [114.3054, 30.5928],
            [113.1289, 29.3571]
        ]
    },
    {
        from: '岳阳',
        to: '长沙',
        path: [
            [113.1289, 29.3571],
            [112.9389, 28.2282]
        ]
    },
    {
        from: '长沙',
        to: '浏阳市',
        path: [
            [112.9389, 28.2282],
            [113.6431, 28.1628]
        ]
    },
    {
        from: '浏阳市',
        to: '南京',
        path: [
            [113.6431, 28.1628],
            [118.7969, 32.0603]
        ]
    },
    {
        from: '南京',
        to: '泰州',
        path: [
            [118.7969, 32.0603],
            [119.9231, 32.4558]
        ]
    },
    {
        from: '泰州',
        to: '重庆',
        path: [
            [119.9231, 32.4558],
            [106.5516, 29.5630]
        ]
    },
    {
        from: '重庆',
        to: '云阳县',
        path: [
            [106.5516, 29.5630],
            [108.6973, 30.9306]
        ]
    },
    {
        from: '云阳县',
        to: '石首市',
        path: [
            [108.6973, 30.9306],
            [112.4257, 29.7209]
        ]
    },
    {
        from: '长沙南站',
        to: '青海西宁市',
        path: [
            [113.06551, 28.147093],//长沙南
            [113.207352, 29.366234],//岳阳东
            [114.424338, 30.606981],//武汉
            [113.978809,33.000575],//
            [113.963964,33.572482],//
            [113.658097,34.745795],//
            [112.456291,34.593842],//
            [110.688869,34.577827],//
            [110.098646,34.581727],//
            [108.938757, 34.37666],//
            [108.053102, 34.254013],//
            [107.232455, 34.334906],//
            [105.85647, 34.549777],//
            [103.850337, 36.034476],//兰州西
            [101.814362, 36.620233]//西宁
        ]
    }
];



